{
    "headline": "Chicken with Chanterelle Mushrooms and Marsala Wine",
    "name": "Chicken with Chanterelle Mushrooms and Marsala Wine",
    "description": "This chanterelle chicken and mushroom recipe is perfect for a special dinner at home, any night of the week. Serve with potatoes or over noodles.",
    "recipeCuisine": [
        "U.S.",
        "American"
    ],
    "totalTime": "PT45M",
    "cookTime": "PT30M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "637 kcal",
        "carbohydrateContent": "25 g",
        "cholesterolContent": "161 mg",
        "fiberContent": "2 g",
        "proteinContent": "30 g",
        "saturatedFatContent": "23 g",
        "sodiumContent": "337 mg",
        "sugarContent": "6 g",
        "fatContent": "38 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT15M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "3 tablespoons all-purpose flour",
        "0.5 teaspoon paprika",
        "2 skinless, boneless chicken breast halves",
        "2 tablespoons butter",
        "0.5 pound sliced chanterelle mushrooms",
        "salt and ground black pepper, or to taste",
        "1 cup chicken broth",
        "0.5 cup dry Marsala wine",
        "1 teaspoon dried tarragon, crushed"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Stir flour and paprika together into a shallow dish. Remove and set aside 1 tablespoon of flour mixture for later use. Dredge chicken in remaining flour mixture to coat evenly."
        },
        {
            "@type": "HowToStep",
            "text": "Melt 2 tablespoons butter in a skillet over medium heat; cook and stir chanterelle mushrooms in melted butter until they release their liquid and begin to brown, about 5 minutes. Transfer to a bowl and set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Melt remaining 4 tablespoons butter in the skillet. Cook chicken breasts in the melted butter until browned, about 3 minutes per side. Season with salt and pepper."
        },
        {
            "@type": "HowToStep",
            "text": "Return cooked mushrooms to the skillet and stir in chicken broth, reserved 1 tablespoon of flour mixture, Marsala wine, and dried tarragon. Cover the skillet, reduce the heat to low, and cook until sauce is thick, about 20 minutes. The chicken should no longer be pink in the center and the juices should run clear. An instant-read thermometer inserted into the center of a chicken breast should read at least 165 degrees F (74 degrees C)."
        }
    ],
    "recipeYield": [
        "2"
    ]
}