{
    "headline": "New York Steaks with a Vanilla and Cherry Sauce",
    "name": "New York Steaks with a Vanilla and Cherry Sauce",
    "description": "Thick New York steaks are grilled to perfection and served with a red wine-cherry sauce in this delicious dish perfect for Valentine's (or any other) day!",
    "recipeCuisine": [
        "U.S."
    ],
    "totalTime": "PT40M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "624 kcal",
        "carbohydrateContent": "37 g",
        "cholesterolContent": "106 mg",
        "fiberContent": "3 g",
        "proteinContent": "36 g",
        "saturatedFatContent": "11 g",
        "sodiumContent": "256 mg",
        "sugarContent": "30 g",
        "fatContent": "28 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT15M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "2 (8 ounce) New York strip steaks",
        "2 tablespoons Worcestershire sauce",
        "salt and pepper to taste",
        "0.75 cup red wine",
        "1 pint fresh cherries, pitted and halved",
        "1 tablespoon white sugar",
        "1 tablespoon vanilla extract",
        "0.5 teaspoon cornstarch",
        "0.25 cup water"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat an outdoor grill for high heat, and lightly oil the grate. Rub the New York steaks on both sides with the Worcestershire sauce, then season to taste with salt and pepper."
        },
        {
            "@type": "HowToStep",
            "text": "Cook the steaks on the preheated grill until they are beginning to firm, and are hot and slightly pink in the center, 6 to 7 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Once the steaks are done, cover them with two layers of aluminum foil, and allow to rest in a warm area for 10 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "While the steaks are cooking, prepare the cherry sauce by bringing the red wine to a boil in a saucepan over medium-high heat; boil for 5 minutes. Stir in the cherries, sugar, and vanilla extract. Return to a boil, then reduce heat to medium, and simmer until the cherries are tender, 5 to 7 minutes. Dissolve the cornstarch in the water, then stir into the simmering cherry sauce. Cook for a few minutes until the cherry sauce thickens. Pour the sauce over the steaks to serve."
        }
    ],
    "recipeYield": [
        "2"
    ]
}