{
    "headline": "Babka",
    "name": "Babka",
    "description": "Babka is a Jewish braided bread made with a sweet and enriched yeast dough. This recipe uses a cinnamon-walnut filling for a delicious addition to brunch.",
    "recipeCuisine": [
        "Polish"
    ],
    "totalTime": "PT265M",
    "cookTime": "PT35M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "338 kcal",
        "carbohydrateContent": "35 g",
        "cholesterolContent": "54 mg",
        "fiberContent": "2 g",
        "proteinContent": "7 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "158 mg",
        "sugarContent": "14 g",
        "fatContent": "20 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT30M",
    "recipeCategory": [
        "Bread"
    ],
    "recipeIngredient": [
        "0.5 cup white sugar",
        "0.25 cup butter",
        "1 teaspoon salt",
        "1 cup hot milk (185 degrees F (85 degrees C))",
        "2 (.25 ounce) packages active dry yeast",
        "0.25 cup warm water (110 degrees F (43 degrees C))",
        "2 eggs",
        "4.5 cups all-purpose flour",
        "3 eggs",
        "1 cup packed light brown sugar",
        "0.33333334326744 cup butter, melted",
        "1.5 teaspoons ground cinnamon",
        "1 teaspoon vanilla extract",
        "4 cups walnuts, chopped",
        "2 tablespoons butter, melted"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Stir white sugar, 1/4 cup butter, and salt into hot milk in a small bowl until butter is melted and mixture is lukewarm. In the work bowl of a stand mixer fitted with a paddle, sprinkle yeast over warm water; stir to dissolve."
        },
        {
            "@type": "HowToStep",
            "text": "Stir milk mixture into yeast mixture. Add 2 eggs and 2 ½  cups of the flour; beat on high until combined. With mixer on low, add remaining 2 cups flour, 1/2 cup at a time."
        },
        {
            "@type": "HowToStep",
            "text": "Switch to the dough hook; mix until dough leaves sides of bowl, about 5 minutes. Set dough in a large, lightly greased bowl, turning dough to coat top. Cover with a towel and let rise in a warm spot until doubled, about 1 hour."
        },
        {
            "@type": "HowToStep",
            "text": "Prepare walnut filling while dough rises. Lightly beat 3 eggs in a large bowl. Stir in brown sugar, 1/3 cup melted butter, cinnamon, and vanilla extract. Fold in walnuts."
        },
        {
            "@type": "HowToStep",
            "text": "Punch dough down. Turn dough out onto a large, lightly floured surface, cover with the bowl, and let rest 10 minutes. Line three 9x5-inch loaf pans with parchment paper, leaving a 2-inch overhang on long sides."
        },
        {
            "@type": "HowToStep",
            "text": "Divide dough into thirds; roll each third out to a 12-inch square on a lightly floured surface. Spoon 1/3 of the walnut filling onto each dough square and spread to within 1/2 inch of the edges. Roll up each square tightly as for a jelly roll. Pinch ends and seams closed to seal. With your palms, roll logs back and forth until uniformly round."
        },
        {
            "@type": "HowToStep",
            "text": "With a sharp knife or dough scraper, cut 1 log in half lengthwise to form 2 striped strands. Working quickly, twist strands loosely together with cut sides facing out, making 2 or 3 wide, horizontal twists. Fit into one of the prepared pans, patting back any loose filling and tucking ends under, if needed. It might look like a mess now, but it comes out beautifully!"
        },
        {
            "@type": "HowToStep",
            "text": "Repeat with remaining logs and pans. Cover pans with a towel and let rise in a warm spot until doubled in size, about 1 hour. Loaves should not rise above top edges of pans."
        },
        {
            "@type": "HowToStep",
            "text": "Preheat oven to 350 degrees F (175 degrees C). Brush loaf tops with remaining 2 tablespoons melted butter."
        },
        {
            "@type": "HowToStep",
            "text": "Bake loaves until puffed, well browned, and a thermometer inserted in centers registers 200 degrees F (93 degrees C), 35 to 45 minutes. Tent with foil if tops brown before loaves are done. Cool in pans for 10 minutes, then use parchment to lift from pans and transfer to a wire rack."
        },
        {
            "@type": "HowToStep",
            "text": "Cool completely, about 1 hour. Glaze if desired, then slice crosswise to serve."
        }
    ],
    "recipeYield": [
        "24"
    ]
}