{
    "headline": "Quick and Easy Sicilian Meatloaf",
    "name": "Quick and Easy Sicilian Meatloaf",
    "description": "This savory Sicilian meatloaf is an eye-catching dish! Unlike regular meatloaf, the ground beef mixture is rolled around slices of ham and Swiss cheese.",
    "recipeCuisine": [
        "Sicilian",
        "American"
    ],
    "totalTime": "PT80M",
    "cookTime": "PT60M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "427 kcal",
        "carbohydrateContent": "21 g",
        "cholesterolContent": "136 mg",
        "fiberContent": "1 g",
        "proteinContent": "34 g",
        "saturatedFatContent": "10 g",
        "sodiumContent": "1065 mg",
        "sugarContent": "8 g",
        "fatContent": "22 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "1.5 pounds lean ground beef",
        "0.5 cup dry bread crumbs",
        "1 (1 ounce) package dry onion soup mix",
        "0.25 cup barbecue sauce",
        "1 clove garlic, minced",
        "1 egg",
        "1 tablespoon all-purpose flour",
        "ground black pepper to taste",
        "8 thin slices deli ham, or as needed",
        "1 cup shredded Swiss cheese, or as needed",
        "0.25 cup ketchup",
        "1 teaspoon mustard",
        "1 tablespoon brown sugar",
        "1 dash soy sauce"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 350 degrees F (175 degrees C). Place a 24-inch sheet of parchment paper onto a work surface."
        },
        {
            "@type": "HowToStep",
            "text": "Mix ground beef, bread crumbs, onion soup mix, barbecue sauce, garlic, egg, flour, and black pepper together in a bowl until well combined. Transfer meat mixture to the parchment paper, and pat it into a 10x16-inch rectangle shape. Layer ham slices on the meat, keeping 1 inch uncovered around all sides of the rectangle. Sprinkle Swiss cheese over ham."
        },
        {
            "@type": "HowToStep",
            "text": "Carefully lift up a short edge of the meat rectangle with the parchment paper, and gently nudge and roll meat up and over the filling. Seal the edges and ends well. Transfer meatloaf to a 9x13-inch baking dish; discard the parchment paper."
        },
        {
            "@type": "HowToStep",
            "text": "Bake in the preheated oven for 45 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Meanwhile, mix ketchup, mustard, brown sugar, and soy sauce together in a bowl until sugar dissolves. Remove meatloaf from the oven and spread ketchup mixture over top. Return to the oven and bake until beef is no longer pink in the center, about 15 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
        }
    ],
    "recipeYield": [
        "6"
    ]
}