{
    "headline": "Cambodian Tapioca-Banana Pudding",
    "name": "Cambodian Tapioca-Banana Pudding",
    "description": "This is a Cambodian recipe that I've learned from a Cambodian-American friend of mine. I'll even eat it for breakfast! It's delicious served warm, can be dressed up with other fruit and is also a refreshing cold dessert.",
    "recipeCuisine": [
        "East And Southeast Asian"
    ],
    "totalTime": "PT50M",
    "cookTime": "PT40M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "253 kcal",
        "carbohydrateContent": "51 g",
        "fiberContent": "3 g",
        "proteinContent": "2 g",
        "saturatedFatContent": "6 g",
        "sodiumContent": "110 mg",
        "sugarContent": "29 g",
        "fatContent": "6 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT10M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "0.5 cup small pearl tapioca",
        "7 cups water, divided",
        "5 medium ripe bananas, sliced",
        "0.25 teaspoon salt",
        "0.5 cup white sugar",
        "0.75 cup coconut milk"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Place 2 cups of water in a microwave-safe dish and heat until warm in the microwave, about 2 minutes. Add the tapioca and let stand for 10 minutes. Drain in a sieve. You'll have a mushy puddle of tapioca left over."
        },
        {
            "@type": "HowToStep",
            "text": "Pour the remaining water into a saucepan and add the drained tapioca. Bring to a boil, then simmer over medium heat until the tapioca begins to turn transparent. Stir frequently to avoid sticking."
        },
        {
            "@type": "HowToStep",
            "text": "When the tapioca is transparent, stir in the bananas, sugar and salt. Simmer for 10 to 15 more minutes, stirring frequently. When the bananas are broken down fairly well, remove from the heat and stir in the coconut milk until well blended. The tapioca pearls will become visible and the pudding will be the consistency of thick soup. Taste and adjust the sugar if desired."
        },
        {
            "@type": "HowToStep",
            "text": "Cool to room temperature or slightly warmer. Stir again before serving."
        }
    ],
    "recipeYield": [
        "6"
    ]
}