{
    "headline": "Banana Pudding with Meringue",
    "name": "Banana Pudding with Meringue",
    "description": "The rich pudding is made on the stovetop, poured over the bananas and wafers, topped with meringue, and then baked in the oven. Passed down from my grandmother, it is a unique take on a Southern favorite.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT35M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "696 kcal",
        "carbohydrateContent": "128 g",
        "cholesterolContent": "104 mg",
        "fiberContent": "5 g",
        "proteinContent": "10 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "298 mg",
        "sugarContent": "60 g",
        "fatContent": "18 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "1 cup packed brown sugar",
        "1 egg",
        "2 egg yolks",
        "1 tablespoon all-purpose flour",
        "1.5 cups milk",
        "6 bananas, peeled and sliced",
        "1 (16 ounce) package vanilla wafer cookies",
        "2 egg whites",
        "3.5 tablespoons white sugar"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 425 degrees F (220 degrees C)."
        },
        {
            "@type": "HowToStep",
            "text": "Line the bottom of a 1 1/2 quart casserole dish with vanilla wafer cookies. Top with a layer of banana slices. Repeat layers until you reach the top of the dish or run out of bananas. Set aside."
        },
        {
            "@type": "HowToStep",
            "text": "In a large saucepan, stir together the brown sugar and flour so there are no lumps. Mix in the egg and egg yolks. Gradually stir in the milk while warming over low heat, stirring constantly until the mixture becomes thick enough to coat the back of a metal spoon. Remove from the heat and allow to cool for about 1 minute. Then, pour the hot pudding evenly over the layers of banana and cookie in the casserole dish."
        },
        {
            "@type": "HowToStep",
            "text": "In a separate clean bowl, whip the egg whites with an electric mixer until they can hold a soft peak. Gradually sprinkle in the sugar while continuing to whip until they can hold a firm peak. Use a spatula to spread the meringue over the top of the casserole."
        },
        {
            "@type": "HowToStep",
            "text": "Bake in the preheated oven until the meringue has browned, 5 to 10 minutes. Serve warm or at room temperature."
        }
    ],
    "recipeYield": [
        "6"
    ]
}