{
    "headline": "Cathead Biscuits",
    "name": "Cathead Biscuits",
    "description": "This is the old-time recipe from our grandmamas. Wonderful and tasty heavy biscuit. Great with homemade sausage gravy.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT25M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "336 kcal",
        "carbohydrateContent": "49 g",
        "cholesterolContent": "17 mg",
        "fiberContent": "2 g",
        "proteinContent": "8 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "910 mg",
        "sugarContent": "3 g",
        "fatContent": "12 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT10M",
    "recipeCategory": [
        "Breakfast"
    ],
    "recipeIngredient": [
        "4 cups self-rising flour (such as WhiteLily®)",
        "1 pinch salt",
        "3 tablespoons room-temperature vegetable shortening (such as Crisco®), or as needed",
        "1.75 cups buttermilk, or as needed",
        "0.25 cup melted butter for brushing, or to taste"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat an oven to 475 degrees F (245 degrees C). Grease an 8-inch cake pan."
        },
        {
            "@type": "HowToStep",
            "text": "Sift flour and salt together into a large mixing bowl. Make a dent in flour by pushing flour from center toward sides of bowl. Add 2 walnut-size lumps of shortening and a splash of buttermilk to the flour where you made the dent. Work the shortening into the flour using fingers in a twisting motion (rub thumb against pointer and middle finger motion) until the shortening is fully incorporated into the flour."
        },
        {
            "@type": "HowToStep",
            "text": "Pour buttermilk into the flour about 1/4 cup at a time, continuing to work it in with your fingers until the buttermilk is completely incorporated into a sticky dough."
        },
        {
            "@type": "HowToStep",
            "text": "Roll dough into 8 large balls and drop into prepared cake pan, working around the outside and putting the last one in middle to fill the pan. Press dough balls with back of fingers to flatten until they touch and are about 3/4- to 1-inch thick."
        },
        {
            "@type": "HowToStep",
            "text": "Bake in preheated oven until the tops are golden brown, 15 to 20 minutes. Brush tops with melted butter."
        }
    ],
    "recipeYield": [
        "8"
    ]
}