{
    "headline": "Fourteen Layer Chocolate Cake",
    "name": "Fourteen Layer Chocolate Cake",
    "description": "Fourteen very thin layers with chocolate between each layer. Hope you enjoy this! I am from Georgia and make it all the time for church functions and family reunions.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT50M",
    "cookTime": "PT30M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "725 kcal",
        "carbohydrateContent": "99 g",
        "cholesterolContent": "151 mg",
        "fiberContent": "2 g",
        "proteinContent": "10 g",
        "saturatedFatContent": "19 g",
        "sodiumContent": "571 mg",
        "sugarContent": "78 g",
        "fatContent": "34 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "0.5 cup shortening",
        "0.5 cup butter",
        "2 cups white sugar",
        "6 eggs",
        "3 cups milk",
        "3 cups self-rising flour",
        "2 teaspoons vanilla extract",
        "3 cups white sugar",
        "1 cup butter",
        "0.5 cup unsweetened cocoa powder",
        "0.25 cup water",
        "2 cups evaporated milk"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 4 or 5 - 8 inch round cake pans."
        },
        {
            "@type": "HowToStep",
            "text": "In a large bowl, cream together the shortening, 1/2 cup butter and 2 cups sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Add the flour alternately with the 3 cups milk; beat well. Pour 1/4 cup of batter into each prepared pan, and spread evenly. You will need to bake the layers in two or three batches."
        },
        {
            "@type": "HowToStep",
            "text": "Bake for 5 to 7 minutes in the preheated oven, just until the layers are dried out. Do not brown."
        },
        {
            "@type": "HowToStep",
            "text": "To make the frosting: In a saucepan over medium heat, combine 3 cups sugar, 1 cup butter, cocoa, water and 2 cups evaporated milk. Bring the mixture to a rolling boil, stirring frequently, then boil for 2 minutes. Remove from heat and beat for one minute with an electric mixer. Stack cake layers with icing in between, letting the icing run down the sides of the cake. Smooth the sides and top with the remaining icing."
        }
    ],
    "recipeYield": [
        "14"
    ]
}