{
    "headline": "Georgia Spiced Peaches",
    "name": "Georgia Spiced Peaches",
    "description": "These spiced peaches are an old Southern family recipe, perfect for holiday desserts or any time of the year that sweet, spiced fruit is desired.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT825M",
    "cookTime": "PT60M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "140 kcal",
        "carbohydrateContent": "36 g",
        "fiberContent": "0 g",
        "sodiumContent": "4 mg",
        "sugarContent": "36 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT45M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "7 pounds white sugar",
        "1 quart water",
        "2 cups distilled white vinegar",
        "19 pounds firm ripe peaches",
        "3 tablespoons crushed cinnamon stick",
        "24 whole cloves"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Inspect as many quart- or gallon-sized jars as needed to fit peaches for cracks and rings for rust, discarding any defective ones. Immerse in simmering water for at least 5 minutes. Wash new, unused lids and rings in warm soapy water."
        },
        {
            "@type": "HowToStep",
            "text": "Bring sugar, water, and vinegar to a boil in a large pot over medium-high heat; boil until syrup is moderately thick. Add peaches, cinnamon, and cloves; continue to boil, stirring occasionally, until peaches can easily be pierced to the pit with a fork."
        },
        {
            "@type": "HowToStep",
            "text": "Fill sterilized canning jars with peaches. Continue boiling syrup until heavy; ladle into jars to cover peaches, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly."
        },
        {
            "@type": "HowToStep",
            "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by 2 inches. Bring to a rolling boil, cover, and process for 35 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Remove the jars from the stockpot and let rest, several inches apart on a wood or cloth-covered surface, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area."
        }
    ],
    "recipeYield": [
        "100"
    ]
}