{
    "headline": "Greg's Southern Biscuits",
    "name": "Greg's Southern Biscuits",
    "description": "Limber up your biscuit-making fingers and try this vintage recipe that's been handed down for generations. Grandmas know the secret to great biscuits is to handle the dough as lightly as possible.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT35M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "189 kcal",
        "carbohydrateContent": "26 g",
        "cholesterolContent": "13 mg",
        "fiberContent": "1 g",
        "proteinContent": "4 g",
        "saturatedFatContent": "4 g",
        "sodiumContent": "433 mg",
        "sugarContent": "2 g",
        "fatContent": "8 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Breakfast"
    ],
    "recipeIngredient": [
        "0.5 teaspoon lard",
        "2 cups all-purpose flour",
        "0.75 teaspoon salt",
        "0.25 teaspoon baking soda",
        "2 teaspoons baking powder",
        "2 tablespoons butter, frozen",
        "2 tablespoons lard, frozen",
        "1 teaspoon bacon drippings",
        "1 cup buttermilk"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet with 1/2 teaspoon of lard."
        },
        {
            "@type": "HowToStep",
            "text": "Mix together the flour, salt, baking soda, and baking powder in a bowl. Grate the frozen butter and 2 tablespoons frozen lard into the flour mixture with a cheese grater; stir lightly 1 or 2 times to mix. With your fingers, make a well in the middle of the flour mixture, and pour the bacon drippings and buttermilk into the well. With just the tips of your fingers, stir lightly and quickly to just bring the dough together before the butter and lard melt. Dough will be sticky."
        },
        {
            "@type": "HowToStep",
            "text": "Scrape dough out onto a floured surface, and gently pat the dough flat. Sprinkle the top of the dough with flour, and fold it in half; pat down, fold again, and repeat until you have folded the dough 4 or 5 times. With a rolling pin, roll the dough out to a square about 1 inch thick. Cut the biscuit dough into rounds with a 2 1/2-inch biscuit cutter or the floured edge of a drinking glass by pushing straight down (twisting the cutter will seal the edge and keep the biscuits from rising). Lay the biscuits onto the prepared baking sheet so the edges just touch."
        },
        {
            "@type": "HowToStep",
            "image": [
                {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/thmb/xI_FiG3Nzw155pNXwuw1yqQ9gRM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/568652-9f927dcdaabf460ba055658770f1fcea.jpg"
                }
            ],
            "text": "Bake in the preheated oven until risen and lightly golden brown, 15 to 20 minutes."
        }
    ],
    "recipeYield": [
        "8"
    ]
}