{
    "headline": "Super Easy Mardi Gras King Cake",
    "name": "Super Easy Mardi Gras King Cake",
    "description": "This easy king cake recipe made with prepared dough, colorful frostings, and sprinkles is a fast Mardi Gras dessert that'll brighten up your party!",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT70M",
    "cookTime": "PT50M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "606 kcal",
        "carbohydrateContent": "95 g",
        "cholesterolContent": "0 mg",
        "fiberContent": "2 g",
        "proteinContent": "5 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "865 mg",
        "sugarContent": "42 g",
        "fatContent": "23 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "3 (14 ounce) cans refrigerated sweet roll dough",
        "2 (12 fluid ounce) cans creamy vanilla ready-to-spread frosting",
        "0.25 cup milk",
        "2 drops green food coloring",
        "2 drops yellow food coloring",
        "1 drop red food coloring",
        "1 drop blue food coloring",
        "0.5 cup multi-colored sprinkles"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet."
        },
        {
            "@type": "HowToStep",
            "text": "Unroll dough from each can in a long strand; fold each strand of dough in half, and roll slightly to shape it into a fat log. Shape the logs together on the prepared baking sheet to make a circle, overlapping the ends and pinching them together. Pat dough into shape as necessary to make it even in size all the way around. Cover loosely with foil."
        },
        {
            "@type": "HowToStep",
            "text": "Bake in preheated oven until firm to the touch and golden brown, 50 to 60 minutes. Check often for doneness so the ring doesn't overbake. Place on a wire rack and cool completely."
        },
        {
            "@type": "HowToStep",
            "text": "Place cake ring on a serving plate; cut a slit along the inside and insert a small plastic baby, pushing it far enough into the cake to be hidden from view."
        },
        {
            "@type": "HowToStep",
            "text": "Divide frosting evenly between 4 bowls. Stir 1 tablespoon of milk into each bowl to thin frosting. Use frosting in one bowl to drizzle over cooled cake. To the remaining three bowls of frosting, stir yellow food coloring into one and green into another. Stir red and blue food colorings together with frosting in a third bowl to make purple frosting. Drizzle cake with yellow, green, and purple frostings in any desired pattern. Dust cake with multi-colored sprinkles and decorate with beads, additional plastic babies, curly ribbon, and other festive trinkets."
        }
    ],
    "recipeYield": [
        "12"
    ]
}