{
    "headline": "Ultimate Gulf Coast Gumbo",
    "name": "Ultimate Gulf Coast Gumbo",
    "description": "This gumbo recipe is made with shrimp, crab, chicken, sausage, vegetables, and Cajun spices. Serve it over rice with garlic bread and a cold beer.",
    "recipeCuisine": [
        "Southern"
    ],
    "totalTime": "PT240M",
    "cookTime": "PT150M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "333 kcal",
        "carbohydrateContent": "7 g",
        "cholesterolContent": "204 mg",
        "fiberContent": "1 g",
        "proteinContent": "33 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "999 mg",
        "sugarContent": "2 g",
        "fatContent": "18 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT90M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "4 pounds medium shrimp",
        "2 quarts water",
        "0.5 cup corn oil",
        "0.5 cup all-purpose flour",
        "1 cup chicken broth",
        "1 cup water",
        "1 (3 pound) whole chicken",
        "5 large tomatoes, chopped",
        "2 medium onions, chopped",
        "5 stalks celery, chopped",
        "1 medium green bell pepper, chopped",
        "4 cloves garlic, minced",
        "2 tablespoons seafood seasoning (such as Old Bay®)",
        "1 tablespoon salt",
        "1 tablespoon ground cayenne pepper",
        "2 bay leaves",
        "3 (6 ounce) cans crabmeat, drained",
        "1 pound andouille sausage, diced",
        "2 tablespoons filé powder"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Peel and devein shrimp. Place shrimp into a bowl; cover and refrigerate until needed. Place shrimp heads and shells into a large pot."
        },
        {
            "@type": "HowToStep",
            "text": "Pour 2 quarts water into the pot, cover, and simmer over medium-low heat until liquid is reduced by half. Strain out and discard shrimp heads and shells. Reserve shrimp broth."
        },
        {
            "@type": "HowToStep",
            "text": "Heat oil in a very large stockpot over medium-high heat. Add flour; cook and stir with a long-handled spoon until dark brown and flour puffs and starts to absorb oil, 10 to 15 minutes. Slowly stir in chicken broth and 1 cup water. Place chicken into the pot; add tomatoes, onions, celery, bell pepper, garlic, seafood seasoning, salt, cayenne pepper, and bay leaves. Bring to a boil and cook until chicken is no longer pink at the bone and the juices run clear, about 1 1/2 hours. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C)."
        },
        {
            "@type": "HowToStep",
            "text": "Remove chicken from the pot and set aside until cool enough to handle. Remove and discard bones; chop meat into 1-inch pieces."
        },
        {
            "@type": "HowToStep",
            "text": "Return chopped chicken to the pot, along with reserved shrimp broth, crabmeat, sausage, shrimp, and filé powder; stir from the bottom of the pot to combine. Bring to a boil, then immediately remove from the heat."
        },
        {
            "@type": "HowToStep",
            "text": "Stir gumbo from the bottom for 1 minute. Remove bay leaves and serve."
        }
    ],
    "recipeYield": [
        "20"
    ]
}