{
    "headline": "Hot Dog Chili for Chili Dogs",
    "name": "Hot Dog Chili for Chili Dogs",
    "description": "A tangy, spicy chili with ground beef and bacon is made just for slathering on a chili dog. It should be thick enough to stay where you put it.",
    "recipeCuisine": [
        "New England",
        "American"
    ],
    "totalTime": "PT105M",
    "cookTime": "PT75M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "261 kcal",
        "carbohydrateContent": "20 g",
        "cholesterolContent": "49 mg",
        "fiberContent": "6 g",
        "proteinContent": "19 g",
        "saturatedFatContent": "4 g",
        "sodiumContent": "470 mg",
        "sugarContent": "4 g",
        "fatContent": "13 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT30M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "3 dried ancho chiles, stems removed but seeds left in",
        "1 cup boiling water",
        "3 slices thick-cut bacon, chopped",
        "2 tablespoons bacon drippings",
        "1 white onion, diced",
        "1 sweet red onion, diced",
        "1 pinch salt",
        "6 cloves garlic, minced",
        "3 cups boiling water",
        "2 pounds ground beef chuck",
        "1 (6 ounce) can tomato paste",
        "2 packets low-sodium beef bouillon granules",
        "0.25 cup spicy brown mustard",
        "0.25 cup dark red chili powder",
        "0.25 cup Worcestershire sauce",
        "0.25 cup ground cumin",
        "2 tablespoons garlic powder",
        "2 tablespoons adobo seasoning with cumin",
        "2 tablespoons paprika",
        "1 (15 ounce) can kidney beans, rinsed and drained",
        "0.25 cup masa harina, or as needed",
        "salt and ground black pepper to taste"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Place ancho chiles into 1 cup boiling water and set aside until softened, about 15 minutes. While chiles are soaking, place bacon in a large saucepan and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes. Drain excess grease but reserve 2 tablespoons bacon drippings in the pan."
        },
        {
            "@type": "HowToStep",
            "text": "Cook and stir white and red onion in bacon drippings with bacon over medium heat with a pinch of salt until onions are translucent, about 5 minutes; stir in garlic and cook until softened, about 1 more minute. Pour in 3 cups boiling water and stir in beef chuck, mixing the meat with the water to break it apart. Bring to a boil and reduce heat to low."
        },
        {
            "@type": "HowToStep",
            "text": "Stir in tomato paste and beef bouillon granules until the granules dissolve; allow mixture to simmer while you complete remaining steps."
        },
        {
            "@type": "HowToStep",
            "text": "Place soaked ancho chiles and their liquid, spicy brown mustard, chili powder, Worcestershire sauce, cumin, garlic powder, adobo seasoning, and paprika into a blender and blend until smooth; pour mixture into the chili. Use a little water to dissolve remaining mixture in blender and pour into the chili."
        },
        {
            "@type": "HowToStep",
            "text": "Bring chili to a slow boil over medium-low heat and stir in kidney beans and masa harina. Reduce heat to low; allow to simmer until thick and the flavors have blended, at least 45 more minutes. Season with salt and black pepper. If chili is too thin, mix in more masa harina."
        }
    ],
    "recipeYield": [
        "12"
    ]
}