{
    "headline": "Chinese Hand-Pulled Noodles in Beef Broth",
    "name": "Chinese Hand-Pulled Noodles in Beef Broth",
    "description": "This is an authentic Chinese recipe for hand-pulled noodles (called &#34;lamian&#34;) in a savory homemade beef broth.",
    "recipeCuisine": [
        "Chinese"
    ],
    "totalTime": "PT235M",
    "cookTime": "PT165M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "671 kcal",
        "carbohydrateContent": "101 g",
        "cholesterolContent": "53 mg",
        "fiberContent": "5 g",
        "proteinContent": "29 g",
        "saturatedFatContent": "4 g",
        "sodiumContent": "1816 mg",
        "sugarContent": "2 g",
        "fatContent": "15 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT30M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "1 gallon water",
        "2 pounds boneless beef shoulder, cubed",
        "0.25 cup sliced fresh ginger",
        "2 tablespoons Szechuan peppercorns",
        "2 dried tsaoko",
        "2 pieces dried mandarin orange peel",
        "4 bay leaves",
        "2 tablespoons salt, or to taste",
        "8 cups all-purpose flour",
        "2.5 cups water",
        "0.25 cup vegetable oil",
        "1 pound daikon (white radish), peeled and sliced",
        "3 stalks green garlic, chopped",
        "1 bunch fresh cilantro, chopped",
        "8 drops chili oil, or to taste"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Bring water to a boil in a large pot. Add beef, ginger, Szechuan peppercorns, dried tsaoko, dried mandarin peels, and bay leaves; bring soup back to a boil, reduce to a simmer and cook, covered, for 2 hours."
        },
        {
            "@type": "HowToStep",
            "text": "Discard whole spices. Season beef broth with salt to taste. Cover and keep warm."
        },
        {
            "@type": "HowToStep",
            "text": "Place flour in a large bowl and gradually mix in water. Mix until dough comes together; knead until smooth, 15 to 20 minutes. Cover with plastic wrap and let rest for 15 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Knead dough again for 2 minutes; cover and let rest for 15 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Knead dough one more time for 2 minutes. Divide into 4 equal pieces. Roll each piece into a 3/8-inch-thick sheet. Brush both sides of each sheet with oil. Stack sheets together; cover with plastic wrap and let rest for 10 to 15 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Fill a large saucepan with water and bring to a boil. Add sliced daikon and cook for 10 to 15 minutes. Remove using a slotted spoon and drain well; set aside. Save water to cook the noodles."
        },
        {
            "@type": "HowToStep",
            "text": "Place 1 sheet of dough on a cutting board and slice into 1/8-inch-wide strips. Take one end of a strip in each hand and stretch it until it is 30 to 35 inches long. Fold it into thirds and stretch again to the same length; shake and slap against the counter several times to lengthen it to 2 to 3 yards. Drop it into the boiling water. Add 2 to 3 more strips of noodles to the boiling water; cook until tender, 5 to 10 minutes. Transfer drained noodles to a serving bowl."
        },
        {
            "@type": "HowToStep",
            "text": "Repeat the process with the remaining sheets of dough. Pour beef broth on top of the drained noodles and top with cooked beef, daikon, chopped green garlic, cilantro, and chili oil."
        }
    ],
    "recipeYield": [
        "8"
    ]
}