{
    "headline": "Chinese-Style Baby Bok Choy with Mushroom Sauce",
    "name": "Chinese-Style Baby Bok Choy with Mushroom Sauce",
    "description": "Baby bok choy, lightly cooked just until bright green, is the star of this Chinese side dish, which gets earthy sweetness from oyster sauce and portobello mushrooms.",
    "recipeCuisine": [
        "Chinese"
    ],
    "totalTime": "PT35M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "69 kcal",
        "carbohydrateContent": "5 g",
        "fiberContent": "1 g",
        "proteinContent": "2 g",
        "saturatedFatContent": "1 g",
        "sodiumContent": "175 mg",
        "sugarContent": "2 g",
        "fatContent": "5 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dinner",
        "Side Dish"
    ],
    "recipeIngredient": [
        "2 tablespoons oyster sauce",
        "1 tablespoon soy sauce",
        "2 teaspoons brown sugar",
        "1 tablespoon water",
        "1 teaspoon potato starch",
        "0.25 teaspoon vegetable oil",
        "2 pinches salt",
        "4 heads baby bok choy",
        "3 tablespoons olive oil",
        "2 tablespoons minced green onion",
        "1 tablespoon minced garlic",
        "1 (8 ounce) package sliced portobello mushrooms"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Mix together oyster sauce, soy sauce, and brown sugar in a medium bowl until sugar is dissolved. Mix together water and potato starch in a small bowl until smooth; stir into oyster sauce mixture until well combined. Set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Fill a large pot with water and bring to a boil. Stir in vegetable oil and 2 pinches salt. Place bok choy into boiling water; cook until tender, shiny, and bright green, 2 to 3 minutes. Drain and arrange bok choy attractively on a serving platter."
        },
        {
            "@type": "HowToStep",
            "text": "Heat olive oil in a large skillet or wok until shimmering. Cook and stir green onion and garlic in hot oil until fragrant, about 20 seconds; stir in mushrooms. Cook and stir until mushrooms begin to shrink slightly. Sprinkle lightly with salt. Continue to cook mushrooms, stirring often, until tender, about 5 minutes. Pour in oyster sauce mixture and stir until sauce is thickened and coats mushrooms, 30 seconds to 1 minute. Pour mushroom sauce over bok choy on the platter. Serve hot."
        }
    ],
    "recipeYield": [
        "8"
    ]
}