{
    "headline": "Vegetarian Chinese Fried Noodles",
    "name": "Vegetarian Chinese Fried Noodles",
    "description": "A quick vegetarian Chinese fried noodle dish with lots of vegetables that's on the table in under 30 minutes. Use whatever vegetables you want for this recipe.",
    "recipeCuisine": [
        "Chinese"
    ],
    "totalTime": "PT30M",
    "cookTime": "PT10M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "695 kcal",
        "carbohydrateContent": "84 g",
        "cholesterolContent": "266 mg",
        "fiberContent": "10 g",
        "proteinContent": "25 g",
        "saturatedFatContent": "6 g",
        "sodiumContent": "1127 mg",
        "sugarContent": "7 g",
        "fatContent": "31 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "0.25 cup oil, divided, or as needed",
        "3 large eggs",
        "3.5 cups trimmed and chopped fresh green beans",
        "5 mushrooms, sliced",
        "1 green bell pepper, cut into matchsticks",
        "1 carrot, cut into matchsticks",
        "1 (10 ounce) package egg noodles",
        "2 tablespoons water",
        "2 tablespoons light soy sauce",
        "1 tablespoon doubanjiang (soybean paste)",
        "1 tablespoon oyster sauce",
        "1.5 teaspoons dark soy sauce",
        "1.5 teaspoons sesame oil",
        "1 medium spring onion, finely sliced"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Heat 2 teaspoons oil in a large skillet over high heat. Whisk eggs together in a bowl. Pour into the skillet and stir-fry quickly until lightly set, about 2 minutes. Remove from heat and transfer to a large plate. Set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Heat 3 tablespoons oil in a wok over high heat. Add green beans, mushrooms, bell pepper, and carrot; stir-fry for 2 to 3 minutes. Remove from heat and transfer to a large plate; set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Meanwhile, fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until they are just starting to soften, but are still pretty firm, about 4 minutes. Drain and rinse cooked noodles under cold running water. Drain and separate. Transfer to a bowl and add just enough oil to coat the noodles so they won't clump together."
        },
        {
            "@type": "HowToStep",
            "text": "Whisk water, light soy sauce, soybean paste, oyster sauce, dark soy sauce, and sesame oil together in a bowl until sauce is well combined."
        },
        {
            "@type": "HowToStep",
            "text": "Combine cooked noodles, vegetables, eggs, and sauce in the same wok and stir fry over medium-high heat until everything is warmed through and noodles and vegetables are cooked to your liking, 1 to 2 minutes. Serve immediately sprinkled with spring onions."
        }
    ],
    "recipeYield": [
        "3"
    ]
}