{
    "headline": "Chicken Saltimbocca",
    "name": "Chicken Saltimbocca",
    "description": "Chicken saltimbocca is a mouthwatering combination of chicken cutlets and sage, wrapped in Italian prosciutto and pan-fried with a buttery sauce.",
    "recipeCuisine": [
        "Italian Inspired",
        "Italian"
    ],
    "totalTime": "PT30M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "350 kcal",
        "carbohydrateContent": "1 g",
        "cholesterolContent": "116 mg",
        "proteinContent": "36 g",
        "saturatedFatContent": "7 g",
        "sodiumContent": "694 mg",
        "sugarContent": "0 g",
        "fatContent": "19 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT15M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "8 (6 ounce) chicken cutlets",
        "1 teaspoon salt",
        "0.5 teaspoon black pepper",
        "16 large fresh sage leaves",
        "16 thin slices prosciutto",
        "3 tablespoons olive oil",
        "1 cup dry white wine",
        "1 cup low-sodium chicken broth",
        "0.5 stick butter"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "If cutlets are thick, lay them between 2 sheets of wax paper and pound to 1/2-inch thickness using the flat side of a meat mallet or the bottom of a small, heavy skillet. Season with salt and pepper. Place 2 large sage leaves on top of each cutlet, then wrap 2 slices prosciutto crosswise around each cutlet, holding sage in place."
        },
        {
            "@type": "HowToStep",
            "text": "Heat 1 1/2 tablespoons olive oil in a large skillet over medium heat. Add 4 cutlets and cook until no longer pink in the center and the juices run clear, about 2 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer to a platter; tent with foil to keep warm. Repeat with remaining 1 1/2 tablespoons olive oil and remaining 4 cutlets."
        },
        {
            "@type": "HowToStep",
            "text": "Pour wine into the same skillet; simmer, scraping up any browned bits with a wooden spoon, about 1 minute. Pour in broth and simmer until slightly reduced, 4 to 5 minutes. Remove from heat; add butter and swirl the skillet until butter has melted and sauce is creamy. Spoon 2 tablespoons sauce over each cutlet to serve."
        }
    ],
    "recipeYield": [
        "8"
    ]
}