{
    "headline": "New Year's &#34;Good Luck&#34; Pasta Fazool",
    "name": "New Year's &#34;Good Luck&#34; Pasta Fazool",
    "description": "Chef John's New Year's good luck pasta fazool (pasta e fagioli) with bacon, Swiss chard, and cannellini beans will make you feel lucky whenever you eat it.",
    "recipeCuisine": [
        "Italian Inspired"
    ],
    "totalTime": "PT65M",
    "cookTime": "PT45M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "293 kcal",
        "carbohydrateContent": "35 g",
        "cholesterolContent": "25 mg",
        "fiberContent": "6 g",
        "proteinContent": "17 g",
        "saturatedFatContent": "3 g",
        "sodiumContent": "1762 mg",
        "sugarContent": "3 g",
        "fatContent": "10 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT20M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "12 ounces bacon, sliced into 1-inch pieces",
        "0.5 cup diced onion",
        "0.5 cup diced celery",
        "1 teaspoon salt, plus more to taste",
        "2 tablespoons tomato paste",
        "0.5 teaspoon freshly ground black pepper",
        "0.25 teaspoon dried thyme",
        "0.25 teaspoon dried oregano",
        "1 pinch cayenne pepper, or to taste",
        "4 cloves garlic, finely minced",
        "4 cups chicken broth",
        "1 cup water",
        "1 large bunch Swiss chard",
        "1 (15.5 ounce) can cannellini beans, drained",
        "1.25 cups orecchiette pasta",
        "1 tablespoon freshly grated Parmigiano-Reggiano, or to taste",
        "1 drizzle olive oil",
        "1 pinch red pepper flakes, or to taste"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Heat a soup pot over medium heat. Add bacon; cook, stirring occasionally, until most fat has rendered and bacon begins to crisp, about 5 minutes. Drain off all but about about 1 tablespoon fat. Add onion, celery, and salt; sauté until softened and onion turns translucent, 5 to 7 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Stir in tomato paste, black pepper, dried oregano, dried thyme, and cayenne pepper. Cook, stirring occasionally, until tomato paste starts to caramelize onto bottom of the pot, about 2 minutes. Add minced garlic; cook and stir 1 to 2 minutes. Stir in chicken broth and water; increase heat to high and bring to a simmer. Reduce heat to medium; simmer while you prep Swiss chard."
        },
        {
            "@type": "HowToStep",
            "text": "Remove chard leaves from stems; discard stems. Gather a handful of leaves and slice in one direction; turn and slice in other direction. Repeat with remaining chard leaves; place into a bowl and fill with water. Swish leaves to remove dirt; transfer washed leaves to another bowl, a handful at a time, to drain."
        },
        {
            "@type": "HowToStep",
            "text": "Add Swiss chard to pot; simmer over medium heat until leaves become tender, about 10 minutes. Season with salt."
        },
        {
            "@type": "HowToStep",
            "text": "Stir in beans; increase heat to high and bring to a boil. Stir in pasta; reduce heat to medium-high. Cook until pasta is tender, 12 to 15 minutes, stirring occasionally."
        },
        {
            "@type": "HowToStep",
            "image": [
                {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/thmb/YFWXAHodQosbzYkOn5zxZBbJcPs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/7558057-584aa856373b47a992e9dfef7fa8ce80.jpg"
                }
            ],
            "text": "Check and adjust seasoning. Serve immediately in large bowls; top with Parmigiano-Reggiano cheese, a drizzle of olive oil, and red pepper flakes."
        }
    ],
    "recipeYield": [
        "6"
    ]
}