{
    "headline": "Loukoumades",
    "name": "Loukoumades",
    "description": "This loukoumades recipe makes yeast-risen dough puffs that are deep-fried until golden brown, drizzled with honey syrup, and sprinkled with cinnamon.",
    "recipeCuisine": [
        "Greek"
    ],
    "totalTime": "PT90M",
    "cookTime": "PT15M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "167 kcal",
        "carbohydrateContent": "24 g",
        "cholesterolContent": "29 mg",
        "fiberContent": "1 g",
        "proteinContent": "3 g",
        "saturatedFatContent": "2 g",
        "sodiumContent": "122 mg",
        "sugarContent": "8 g",
        "fatContent": "7 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT10M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "2 (.25 ounce) packages active dry yeast",
        "1 cup warm water",
        "0.5 cup warm milk",
        "0.25 cup white sugar",
        "1 teaspoon salt",
        "4 cups all-purpose flour",
        "3 eggs",
        "0.33333334326744 cup butter, softened",
        "0.5 cup honey",
        "0.5 cup water",
        "4 cups vegetable oil, or as needed",
        "2 teaspoons ground cinnamon"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Sprinkle yeast over 1 cup warm water in a small bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Mix together warm milk, sugar, and salt in a large bowl until sugar and salt are dissolved. Pour in yeast mixture and stir to combine."
        },
        {
            "@type": "HowToStep",
            "text": "Beat in flour, eggs, and butter until mixture forms a smooth, soft dough. Cover the bowl and let rise at room temperature until doubled in volume, about 30 minutes. Stir dough well, cover, and let rise again for 30 more minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Meanwhile, mix together honey and 1/2 cup water in a small saucepan; bring to a boil over medium-high heat. Turn off the heat and allow honey syrup to cool."
        },
        {
            "@type": "HowToStep",
            "text": "Heat 2 inches oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C)."
        },
        {
            "@type": "HowToStep",
            "text": "Place a large serving or soup spoon in a glass of water near dough. Scoop up about 2 tablespoons dough per puff with the wet spoon, drop it into the wet palm of your hand, and roll it back into the spoon to create a round shape. Do not overhandle the puffy, soft dough."
        },
        {
            "@type": "HowToStep",
            "text": "Drop dough balls into hot oil in batches, wetting the spoon each time you make a dough ball. Fry in hot oil until golden brown on the bottom, then roll them over to cook the other side, 2 to 3 minutes per batch. Gently set loukoumades aside to drain on a paper towel-lined plate."
        },
        {
            "@type": "HowToStep",
            "text": "Place loukoumades on a baking sheet. Drizzle with honey syrup and sprinkle with cinnamon. Serve warm."
        }
    ],
    "recipeYield": [
        "25"
    ]
}