{
    "headline": "Dupre Family Chicken and Sausage Gumbo",
    "name": "Dupre Family Chicken and Sausage Gumbo",
    "description": "This chicken gumbo pairs meaty chicken drumsticks and bone-in breasts with smoked sausage in a savory broth. It’s the real deal from a certified Cajun!",
    "recipeCuisine": [
        "Cajun"
    ],
    "totalTime": "PT300M",
    "cookTime": "PT195M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "825 kcal",
        "carbohydrateContent": "32 g",
        "cholesterolContent": "130 mg",
        "fiberContent": "1 g",
        "proteinContent": "42 g",
        "saturatedFatContent": "12 g",
        "sodiumContent": "1206 mg",
        "sugarContent": "3 g",
        "fatContent": "58 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT45M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "7 chicken drumsticks, with skin",
        "6 bone-in chicken breast halves, with skin",
        "1 tablespoon Cajun seasoning blend (such as Tony Chachere's®), or to taste",
        "0.5 cup olive oil",
        "0.5 cup dry white wine",
        "4 cups chicken broth",
        "1 large yellow onion, chopped",
        "1 large green bell pepper, chopped",
        "1 large celery stalk, chopped",
        "3 tablespoons olive oil",
        "1 cup all-purpose flour",
        "1 cup canola oil",
        "10 cups boiling water, divided",
        "1 teaspoon garlic powder, or to taste",
        "1 teaspoon cayenne pepper, or to taste",
        "1.5 pounds smoked sausage, cut into 1/2-inch slices",
        "2 cups uncooked jasmine rice",
        "3 cups water",
        "1 bunch green onions, chopped"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Peel back chicken drumstick and breast skin without removing it all the way; make several deep cuts in the meat. Sprinkle 3 teaspoons Cajun seasoning into the cuts and onto the meat, then replace the skin. Whisk 1/2 cup olive oil and white wine together in a large bowl. Add chicken, spoon marinade over top, then cover and refrigerate for 1 hour."
        },
        {
            "@type": "HowToStep",
            "text": "Remove chicken from marinade and shake off excess; discard remaining marinade. Heat 1/4 cup olive oil in a large skillet over medium heat until shimmering. Add chicken, working in batches if necessary, and cook until browned, about 5 minutes per side. Transfer chicken to a large soup pot and pour broth over top. Bring to a boil, then reduce the heat and simmer until chicken is tender, about 20 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "While the chicken is simmering, cook onion, bell pepper, and celery in a skillet with 3 tablespoons of olive oil, stirring occasionally, until onion is transparent and pepper has softened, about 8 minutes. Remove from the heat and set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Mix flour and canola oil together in a nonstick pan to make a roux; stir until smooth and lump-free. Heat over medium-high heat, stirring constantly with a wooden spoon and scraping the bottom of the pan to prevent burning. After about 5 minutes of stirring, the roux will begin to turn a pale golden color and gently bubble and foam. Stir roux until it turns the color of milk chocolate and gives off a nutty fragrance, 30 to 40 more minutes. Watch carefully so it doesn't burn. Remove from the heat and stir until roux cools and stops cooking, about 5 more minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Stir onion mixture and 1 cup boiling water into roux; be careful to avoid spattering. Heat over medium heat until mixture comes to a simmer. Whisk until roux and water combine and become thick, about 10 minutes. Add thickened roux to the chicken, stir together, and add remaining 9 cups boiling water. Season with remaining 2 teaspoons Cajun seasoning and bring to a rolling boil. Reduce the heat and simmer for 1 hour."
        },
        {
            "@type": "HowToStep",
            "text": "Sprinkle garlic powder and cayenne pepper over smoked sausage. Brown sausage in a skillet with 2 tablespoons of olive oil. Transfer sausage to the soup and simmer for 30 more minutes. Remove chicken from the pot and take meat off bones; discard skin and bones. Return meat to the soup and simmer for 15 more minutes. Skim off the layer of oil that forms on the top."
        },
        {
            "@type": "HowToStep",
            "text": "While the gumbo is simmering, bring rice and 3 cups water to a boil in a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Serve gumbo over hot, cooked rice with a generous sprinkling of chopped green onions over each serving."
        }
    ],
    "recipeYield": [
        "15"
    ]
}