{
    "headline": "Husband's Grandmother's Shrimp Gumbo",
    "name": "Husband's Grandmother's Shrimp Gumbo",
    "description": "A family specialty, this authentic gumbo was prepared for Cajun festivals, and people lined up to taste it! Serve this gumbo over cooked white rice.",
    "recipeCuisine": [
        "Cajun"
    ],
    "totalTime": "PT180M",
    "cookTime": "PT135M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "344 kcal",
        "carbohydrateContent": "13 g",
        "cholesterolContent": "165 mg",
        "fiberContent": "2 g",
        "proteinContent": "24 g",
        "saturatedFatContent": "10 g",
        "sodiumContent": "922 mg",
        "sugarContent": "3 g",
        "fatContent": "22 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT45M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "1 pound smoked sausage links, cut into 1/4-inch slices",
        "0.25 pound bacon, chopped",
        "2 cups chopped okra",
        "1 (14.5 ounce) can diced tomatoes with green chile peppers",
        "0.5 cup unsalted butter",
        "2 cups chopped onion",
        "0.66666668653488 cup finely chopped green bell pepper",
        "0.66666668653488 cup finely chopped celery",
        "0.5 cup chopped green onions",
        "2 tablespoons chopped fresh parsley",
        "2 tablespoons minced garlic",
        "0.66666668653488 cup all-purpose flour",
        "2 cups water",
        "salt to taste",
        "0.25 teaspoon cayenne pepper",
        "1 teaspoon dried thyme",
        "2 bay leaves",
        "2 pounds uncooked medium shrimp, peeled and deveined"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Brown sausages in a skillet over medium heat. Drain sausages on a paper-towel-lined plate and set aside. Drain skillet. Cook bacon until crisp, 6 to 8 minutes. Remove bacon to the plate with sausages. Cook okra in bacon drippings until tender, about 5 minutes. Drain okra in a colander. Drain the skillet."
        },
        {
            "@type": "HowToStep",
            "text": "Place okra and tomatoes in the skillet over medium heat. Bring to a simmer. Reduce heat to medium-low, and simmer until slightly thickened, about 10 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Melt butter in a large pot over medium heat. Add onion, bell pepper, celery, green onions, parsley, and garlic. Cook until onions turn brown, about 10 minutes. Remove vegetables, leaving liquid in the pot behind. Stir in flour, reduce heat to low. Cook, stirring constantly, until roux turns the color of milk chocolate, 30 to 45 minutes. Do not burn."
        },
        {
            "@type": "HowToStep",
            "text": "Whisk in 2 cups water, raise the heat to medium, and stir in salt, pepper, cayenne pepper, thyme, and bay leaves. Bring mixture to a boil. Stir in sausage, bacon, okra-tomato mixture, and remaining 6 cups water."
        },
        {
            "@type": "HowToStep",
            "text": "Reduce heat to medium-low, and simmer gumbo, stirring occasionally, until stew thickens and flavors are blended, about 45 minutes. Add shrimp, and simmer until pink and opaque, 6 to 8 more minutes. Discard bay leaves and adjust seasonings, if desired, before serving."
        }
    ],
    "recipeYield": [
        "12"
    ]
}