{
    "headline": "Strawberry Pavlova",
    "name": "Strawberry Pavlova",
    "description": "This strawberry pavlova is filled with whipped cream spiked with orange liqueur and topped with fresh strawberries for a gorgeous summer dessert.",
    "recipeCuisine": [
        "Australian"
    ],
    "totalTime": "PT115M",
    "cookTime": "PT75M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "282 kcal",
        "carbohydrateContent": "28 g",
        "cholesterolContent": "54 mg",
        "fiberContent": "1 g",
        "proteinContent": "3 g",
        "saturatedFatContent": "11 g",
        "sodiumContent": "49 mg",
        "sugarContent": "26 g",
        "fatContent": "17 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT40M",
    "recipeCategory": [
        "Dessert"
    ],
    "recipeIngredient": [
        "4 egg whites, at room temperature",
        "0.25 teaspoon cream of tartar",
        "Pinch salt",
        "1 cup sugar",
        "1 tablespoon cornstarch",
        "1 tablespoon white vinegar",
        "1 teaspoon vanilla",
        "2 cups whipping cream",
        "2 tablespoons orange liqueur",
        "4 cups strawberries"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 250 degrees F (120 degrees C). Line a baking sheet with parchment paper or aluminum foil."
        },
        {
            "@type": "HowToStep",
            "text": "Beat egg whites, cream of tartar, and salt in a large bowl with an electric mixer until soft peaks form. Beat in sugar, 1 tablespoon at a time, until stiff, glossy peaks form. Mix in cornstarch, vinegar, and vanilla until blended."
        },
        {
            "@type": "HowToStep",
            "text": "Spread egg white mixture on the prepared baking sheet into a 10-inch (25cm) circle with a raised edge and a slight indentation in the center."
        },
        {
            "@type": "HowToStep",
            "text": "Bake in the preheated oven until meringue is cream-colored and firm to the touch, about 1 hour 15 minutes. If meringue appears to be browning, reduce the oven temperature to 225 degrees F (105 degrees C). Remove meringue from the oven and let cool."
        },
        {
            "@type": "HowToStep",
            "text": "When ready to serve, peel parchment paper off the bottom of meringue. Place meringue onto a serving plate."
        },
        {
            "@type": "HowToStep",
            "text": "Whip cream in a medium bowl with an electric mixer until stiff peaks form. Gently stir in liqueur until incorporated. Spread whipped cream over meringue, leaving edge of meringue visible. Top with strawberries. Cut into wedges to serve."
        }
    ],
    "recipeYield": [
        "10"
    ]
}