{
    "headline": "Pork Loin Roast with Baby Bellas",
    "name": "Pork Loin Roast with Baby Bellas",
    "description": "Boneless pork loin is roasted with baby portabella mushrooms, garlic, and wine, then served with a quick and easy seasoned pan sauce.",
    "recipeCuisine": [
        "Canadian"
    ],
    "totalTime": "PT75M",
    "cookTime": "PT60M",
    "nutrition": {
        "@type": "NutritionInformation",
        "calories": "313 kcal",
        "carbohydrateContent": "2 g",
        "cholesterolContent": "109 mg",
        "fiberContent": "0 g",
        "proteinContent": "39 g",
        "saturatedFatContent": "5 g",
        "sodiumContent": "107 mg",
        "sugarContent": "0 g",
        "fatContent": "14 g",
        "unsaturatedFatContent": "0 g"
    },
    "prepTime": "PT15M",
    "recipeCategory": [
        "Dinner"
    ],
    "recipeIngredient": [
        "1 (3 pound) boneless pork loin roast, trimmed of fat",
        "3 cloves garlic, divided",
        "8 small baby bella mushrooms, roughly chopped",
        "0.5 teaspoon dried parsley",
        "0.25 teaspoon dried thyme",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil",
        "0.5 cup dry white wine",
        "0.5 cup chicken broth",
        "1 teaspoon cornstarch, or as needed",
        "0.5 cup water"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease an 8x10-inch casserole dish."
        },
        {
            "@type": "HowToStep",
            "text": "Use a sharp knife to make 1/2-inch slits in pork roast. Slice 2 garlic cloves; place garlic slices into the slits. Set aside."
        },
        {
            "@type": "HowToStep",
            "text": "Place mushrooms in the bottom of the prepared casserole dish. Sprinkle parsley, thyme, salt, and pepper over mushrooms. Using a microplane, grate remaining garlic clove over mushrooms."
        },
        {
            "@type": "HowToStep",
            "text": "Heat olive oil in a large skillet over medium-high heat. Place pork in the hot skillet and cook, turning occasionally, until lightly browned on all sides, about 5 minutes. Transfer pork to the casserole dish."
        },
        {
            "@type": "HowToStep",
            "text": "Stir together white wine and chicken stock in a cup; pour into the skillet and bring to a boil while scraping the browned bits of food off the bottom of the skillet with a wooden spoon. Pour wine mixture over pork."
        },
        {
            "@type": "HowToStep",
            "text": "Roast in the preheated oven until pork is slightly pink in the center, about 50 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer roast to a serving dish; tent with aluminum foil to keep warm."
        },
        {
            "@type": "HowToStep",
            "text": "Pour drippings into a saucepan; bring to a boil and cook until liquid is reduced by half. Stir cornstarch into water until smooth; pour into drippings and boil until thickened, about 3 minutes. Slice pork roast and serve with mushrooms and pan sauce."
        }
    ],
    "recipeYield": [
        "6"
    ]
}